// Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.

Console.WriteLine("three-digit number: ");
string number = Console.ReadLine();
Console.WriteLine(number[1]);